user/tutorials/Nike/ISAT_paper/2D_shock/shockDroplet_codestream_longer_C12test_D_2d_1C_low_T_ISAT_1e_2/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1e-3;

vertices
(
    (-0.5 -0.5 0)
    (1.5 -0.5 0)
    (1.5 1.5 0)
    (-0.5 1.5 0)
    (-0.5 -0.5 1)
    (1.5 -0.5 1)
    (1.5 1.5 1)
    (-0.5 1.5 1)
    
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (256 256 1) simpleGrading (1 1 1) //block 1
);

edges
(
);

boundary
(
    wall
    {
        type empty;
        faces
        (
            (5 6 7 4)
            (0 3 2 1)
        );
    }
    top
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    bottom
    {
        type patch;
        faces
        (
            (0 1 5 4)
        );
    }
    inlet
    {
        type            patch;//cyclic;
        //neighbourPatch  outlet;
        faces           ((0 4 7 3));
    }
    outlet
    {
        type            patch;//cyclic;
        //neighbourPatch  inlet;
        faces           ((1 2 6 5));
    }  
);


mergePatchPairs
(
);

// ************************************************************************* //
